src/Documents/ПакетНаСайт/ПакетНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПакетНаСайт</name>
  <registerRecords>InformationRegister.ОбменССайтом</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусОтпавкиНаСайт</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Очередь</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ПоступлениеКоробокДляРазбора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазборКоробок</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приходные</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.Приходная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Возвраты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ВозвратПокупокОрганизатору</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходные</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.Расходная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Карты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.КартыУчастников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Транзиты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ВыдачаТранзита</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолученныеДанные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусОтпавкиНаСайт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколыПередач</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтчетОДоставке</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ОтчетОДоставке</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормированиеКоробок</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ФормированиеКоробки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтправлениеТранзита</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ОтправлениеТранзита</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Детально</name>
    <attributes>
      <name>Мегаордер</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПартияДляОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбмена</name>
      <type>
        <types>EnumRef.ТипыОбменов100сп</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатОбмена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочкаПриема</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДвижениеУстарело</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ОбменССайтом/ОбменССайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбменССайтом</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусОтпавкиНаСайт</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КартыУчастников</types>
      <types>DocumentRef.ВыдачаТранзита</types>
      <types>DocumentRef.ФормированиеКоробки</types>
      <types>DocumentRef.ВозвратПокупокОрганизатору</types>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.Расходная</types>
      <types>DocumentRef.ОтчетОДоставке</types>
      <types>DocumentRef.РазборКоробки</types>
      <types>DocumentRef.ПоступлениеКоробокДляРазбора</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусОтпавкиНаСайт/СтатусОтпавкиНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусОтпавкиНаСайт</name>
  <enumValues>
    <name>Сформирован</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Исправлено</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПакетНаСайт/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПакетНаСайт"));
	об.ЗаполнитьТаблицы();
	ЗначениеВДанныеФормы(об,Объект);	
КонецПроцедуры


Функция ПолучитьЗапросПоОбъекту(Объект)
	ЗначениеСортировки="";	
	Если Найти(Объект,"Справочник")>0 Тогда
		ЗначениеСортировки="Код";
	ИначеЕсли Найти(Объект,"Документ")>0 Тогда
		ЗначениеСортировки="Номер";
	КонецЕсли;
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 99999
	|	ОбъектВыгрузки.Ссылка КАК объект,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбменССайтом.Объект), 0) КАК количество
	|ИЗ
	|	"+Объект+" КАК ОбъектВыгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбменССайтом КАК ОбменССайтом
	|		ПО (ОбменССайтом.Объект = ОбъектВыгрузки.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектВыгрузки.Ссылка
	|
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбменССайтом.Объект), 0) = 0 "+?(ЗначениеСортировки="Документ","ОбъектВыгрузки.Проведен "," ")+
	?(ЗначениеСортировки="","","
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектВыгрузки."+ЗначениеСортировки);
КонецФункции	

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьХМЛНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПакетНаСайт"));
	об.СериолизоватьВХМЛ();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьХМЛ(Команда)
	СформироватьХМЛНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПакетНаСайт"));
	об.ОтправитьНаСайт();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
	Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусТранзитовНаСервере()
	Для каждого стр из Объект.Транзиты	Цикл
		стр.Статус=Перечисления.СтатусОтпавкиНаСайт.Отправлен;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтатусТранзитов(Команда)
	ЗаполнитьСтатусТранзитовНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура РазобратьПолученныеДанные(Команда)
	РазобратьПолученныеДанныеНаСервере()
КонецПроцедуры

Процедура РазобратьПолученныеДанныеНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПакетНаСайт"));
	об.ДесериализоватьИзХМЛ();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры
